app/controllers/loyals_controller.rb

  def index
    @loyal = Loyal.all
---
SELECT `loyals`.* FROM `loyals`

  def create
    @loyal = Loyal.new(loyal_params)

    respond_to do |format|
      if @loyal.save
---
INSERT INTO "loyals" ("name", "loyalty", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hello"], ["loyalty", 1], ["created_at", "2015-06-11 13:56:43.252746"], ["updated_at", "2015-06-11 13:56:43.252746"]]

  def destroy
    @loyal.destroy
---
DELETE FROM `loyals` WHERE `loyals`.`id` = 1

    def set_loyal
      @loyal = Loyal.find(params[:id])
---
SELECT  "loyals".* FROM "loyals" WHERE "loyals"."id" = ? LIMIT 1  [["id", 1]]